In [1]:
import matplotlib.pyplot as plt
import networkx as nx
import numpy as np
import pandas as pd
import psycopg2
import sys
import time
from cdlib import algorithms
from cdlib import viz
from datetime import datetime
from urllib.parse import urlparse

np.set_printoptions(threshold=sys.maxsize)

/data2/homes/lpolli/local_communities/euro2020/lib/python3.6/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [2]:
result = urlparse("postgresql://euro2020_guest:bjaskdbsajkd832d38hd@thabit:5432/euro2020")

username = result.username
password = result.password
database = result.path[1:]
hostname = result.hostname
port = result.port

connection = psycopg2.connect(
    database = database,
    user = username,
    password = password,
    host = hostname,
    port = port
)

In [3]:
cursor = connection.cursor()
cursor.execute("SELECT version();")
record = cursor.fetchone()
print("You are connected to ->", record,"\n")

You are connected to -> ('PostgreSQL 13.5 (Debian 13.5-1.pgdg100+1) on x86_64-pc-linux-gnu, compiled by gcc (Debian 8.3.0-6) 8.3.0, 64-bit',)

-------------------------------------

### Retrieve data from main tables: *node, node_type, edge_stream, edge_type*

In [4]:
def query(q):
    '''
    Perform a query to a database
    '''
    data = pd.read_sql(q, connection)
    return data

In [6]:
# First rows of table "node"
data = query("""SELECT *
         FROM node
         LIMIT 5""")
data

   id               txt  typ
0   1     ItsComingRome    1
1   2          EURO2020    1
2   4     Euro2020Final    1
3   6   ITSCOMINGTOROME    1
4   8  itsnotcominghome    1

In [7]:
# First rows of table "node_type"
data = query("""SELECT *
         FROM node_type""")
data

   id   description
0   1       hashtag
1   2  twitter user

In [8]:
# First rows of table "edge_stream"
data = query("""SELECT *
         FROM edge_stream
         ORDER BY timestamp_s DESC
         LIMIT 10""")
data

   timestamp_s  node_1  node_2  typ
0   1626559190       1       2    1
1   1626559190       1       4    1
2   1626559190       1       6    1
3   1626559190       1       8    1
4   1626559190       2       4    1
5   1626559190       2       6    1
6   1626559190       2       8    1
7   1626559190       4       6    1
8   1626559190       4       8    1
9   1626559190       6       8    1

In [9]:
# First rows of table "edge_type"
data = query("""SELECT *
         FROM edge_type""")
data

   id                         description  directed  node_type_1  node_type_2
0   1               hashtag co-occurrence     False            1            1
1   2  twitter user mentions twitter user      True            2            2
2   3           twitter user uses hashtag      True            2            1
3   4          twitter user co-occurrence     False            2            2

-----------------------------------------

### Tables description

In [8]:
# table_name = "node"
query("""SELECT 
           table_name, 
           column_name, 
           data_type 
         FROM 
           information_schema.columns
         WHERE 
           table_name = 'node'
         """)

  table_name column_name          data_type
0       node          id            integer
1       node         txt  character varying
2       node         typ           smallint

In [10]:
query("""SELECT *
         FROM information_schema.key_column_usage
         WHERE table_name = 'node'
      """)

,constraint_catalog,constraint_schema,constraint_name,table_catalog,table_schema,table_name,column_name,ordinal_position,position_in_unique_constraint
0,euro2020,public,node_pkey,euro2020,public,node,id,1,NaN
1,euro2020,public,node_txt_typ_key,euro2020,public,node,txt,1,NaN
2,euro2020,public,node_typ_fkey,euro2020,public,node,typ,1,1.0
3,euro2020,public,node_txt_typ_key,euro2020,public,node,typ,2,NaN

In [10]:
# table_name = "node_type"
query("""SELECT 
           table_name, 
           column_name, 
           data_type
         FROM 
           information_schema.columns
         WHERE 
           table_name = 'node_type'
      """)

  table_name  column_name          data_type
0  node_type           id           smallint
1  node_type  description  character varying

In [11]:
# table_name = "edge_stream"
query("""SELECT 
           table_name, 
           column_name, 
           data_type 
         FROM 
           information_schema.columns
         WHERE 
           table_name = 'edge_stream'
      """)

    table_name  column_name data_type
0  edge_stream  timestamp_s   integer
1  edge_stream       node_1   integer
2  edge_stream       node_2   integer
3  edge_stream          typ  smallint

In [12]:
# table_name = "edge_type"
query("""SELECT 
           table_name, 
           column_name, 
           data_type 
         FROM 
           information_schema.columns
         WHERE 
           table_name = 'edge_type'
      """)

  table_name  column_name          data_type
0  edge_type           id           smallint
1  edge_type  description  character varying
2  edge_type     directed            boolean
3  edge_type  node_type_1           smallint
4  edge_type  node_type_2           smallint